In [2]:
d={"name":"ishita","rollno":"1234","address":"jaipur"}
print(d,type(d))

{'name': 'ishita', 'rollno': '1234', 'address': 'jaipur'} <class 'dict'>

In [3]:
d["address"]
id(d)

140345525580544

In [5]:
d["address"]="ahmedabad"
print(d)
id(d)

{'name': 'ishita', 'rollno': '1234', 'address': 'ahmedabad'}

140345525580544

In [6]:
d["age"]=20
print(d)

{'name': 'ishita', 'rollno': '1234', 'address': 'ahmedabad', 'age': 20}

In [9]:
for k in d:
 print(k)

name
rollno
address
age

In [11]:
for k in d:
 print(k,"---",d[k])

name --- ishita
rollno --- 1234
address --- ahmedabad
age --- 20

In [12]:
print("name" in d)

True

In [13]:
len(d)

4

In [14]:
d.items()

dict_items([('name', 'ishita'), ('rollno', '1234'), ('address', 'ahmedabad'), ('age', 20)])

In [15]:
a=d.items()
for k,j in a:
    print(k,"---",j)

name --- ishita
rollno --- 1234
address --- ahmedabad
age --- 20

In [16]:
d.keys()

dict_keys(['name', 'rollno', 'address', 'age'])

In [17]:
d.values()

dict_values(['ishita', '1234', 'ahmedabad', 20])

In [18]:
d.sort()

AttributeError: 'dict' object has no attribute 'sort'

In [20]:
sorted(d)

['address', 'age', 'name', 'rollno']

In [21]:
sorted(d,reverse=True)

['rollno', 'name', 'age', 'address']

In [22]:
d.popitem()

('age', 20)

In [23]:
d.clear()

In [24]:
d

{}

In [28]:
d={"name":"ishita","rollno":"1234","address":"jaipur"}
d.pop("name")

'ishita'

In [30]:
name=eval(input("enter the names:"))

enter the names:"ish" "tutu""okay"

In [33]:
age=list(map(int,input("enter the age:").split()))
age

enter the age:11 22 33 44 55

[11, 22, 33, 44, 55]

In [1]:
id=list(map(int,input("enter the employ id").split()))
name=input("enter the name").split()
add=input("enter the add").split()
dept=input("enter the dept").split()
age=list(map(int,input("enter the employ age").split()))
phone_no=input("enter the phone number").split()
emp_data={"ID":id,"employ_name":name,"add":add,"dept":dept,"age":age,"PHONE NO":phone_no}  
emp_data

enter the employ id210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225
enter the nameishita rahul ajay vijay ojas palak pallavi deepali kriti tanishka anchita vijay sajal simar megha aditya
enter the addjaipur sikar ajmer ahmedabad jaipur kota hisar sikar sikar jaipur kota ahmedabad bhilwara ajmer jaipur
enter the deptcs it mech cs it mech it it cs cs it mech electrical cs cs
enter the employ age20 21 22 20 21 20 22 23 23 24 21 20 21 22 20
enter the phone number5657484938 3938475647 1937568494 2048593853 3453498679 7647659323 7867676487 5657383947 5757575843 8784857683 3857693758 2857583848 4545454545 7686868683 7878739394

{'ID': [210,
  211,
  212,
  213,
  214,
  215,
  216,
  217,
  218,
  219,
  220,
  221,
  222,
  223,
  224,
  225],
 'employ_name': ['ishita',
  'rahul',
  'ajay',
  'vijay',
  'ojas',
  'palak',
  'pallavi',
  'deepali',
  'kriti',
  'tanishka',
  'anchita',
  'vijay',
  'sajal',
  'simar',
  'megha',
  'aditya'],
 'add': ['jaipur',
  'sikar',
  'ajmer',
  'ahmedabad',
  'jaipur',
  'kota',
  'hisar',
  'sikar',
  'sikar',
  'jaipur',
  'kota',
  'ahmedabad',
  'bhilwara',
  'ajmer',
  'jaipur'],
 'dept': ['cs',
  'it',
  'mech',
  'cs',
  'it',
  'mech',
  'it',
  'it',
  'cs',
  'cs',
  'it',
  'mech',
  'electrical',
  'cs',
  'cs'],
 'age': [20, 21, 22, 20, 21, 20, 22, 23, 23, 24, 21, 20, 21, 22, 20],
 'PHONE NO': ['5657484938',
  '3938475647',
  '1937568494',
  '2048593853',
  '3453498679',
  '7647659323',
  '7867676487',
  '5657383947',
  '5757575843',
  '8784857683',
  '3857693758',
  '2857583848',
  '4545454545',
  '7686868683',
  '7878739394']}

In [3]:
id=list(map(int,input("enter the employ id").split()))
name=input("enter the name").split()
add=input("enter the add").split()
dept=input("enter the dept").split()
age=list(map(int,input("enter the employ age").split()))
phone_no=input("enter the phone number").split()
emp_data={"ID":id,"employ_name":name,"add":add,"dept":dept,"age":age,"PHONE NO":phone_no}  
import pandas as pd
df=pd.DataFrame(emp_data)
df

enter the employ id210 211 212 213 214 215 216 217 218 219 220 221 222 223 224
enter the namerahul ajay vijay ojas palak pallavi deepali kriti tanishka anchita vijay sajal simar megha aditya
enter the addjaipur sikar ajmer ahmedabad jaipur kota hisar sikar sikar jaipur kota ahmedabad bhilwara ajmer jaipur
enter the deptcs it mech cs it mech it it cs cs it mech electrical cs cs
enter the employ age20 21 22 20 21 20 22 23 23 24 21 20 21 22 20
enter the phone number5657484938 3938475647 1937568494 2048593853 3453498679 7647659323 7867676487 5657383947 5757575843 8784857683 3857693758 2857583848 4545454545 7686868683 7878739394

     ID employ_name        add        dept  age    PHONE NO
0   210       rahul     jaipur          cs   20  5657484938
1   211        ajay      sikar          it   21  3938475647
2   212       vijay      ajmer        mech   22  1937568494
3   213        ojas  ahmedabad          cs   20  2048593853
4   214       palak     jaipur          it   21  3453498679
5   215     pallavi       kota        mech   20  7647659323
6   216     deepali      hisar          it   22  7867676487
7   217       kriti      sikar          it   23  5657383947
8   218    tanishka      sikar          cs   23  5757575843
9   219     anchita     jaipur          cs   24  8784857683
10  220       vijay       kota          it   21  3857693758
11  221       sajal  ahmedabad        mech   20  2857583848
12  222       simar   bhilwara  electrical   21  4545454545
13  223       megha      ajmer          cs   22  7686868683
14  224      aditya     jaipur          cs   20  7878739394

In [4]:
df.head()

    ID employ_name        add  dept  age    PHONE NO
0  210       rahul     jaipur    cs   20  5657484938
1  211        ajay      sikar    it   21  3938475647
2  212       vijay      ajmer  mech   22  1937568494
3  213        ojas  ahmedabad    cs   20  2048593853
4  214       palak     jaipur    it   21  3453498679

In [5]:
df.tail()

     ID employ_name        add        dept  age    PHONE NO
10  220       vijay       kota          it   21  3857693758
11  221       sajal  ahmedabad        mech   20  2857583848
12  222       simar   bhilwara  electrical   21  4545454545
13  223       megha      ajmer          cs   22  7686868683
14  224      aditya     jaipur          cs   20  7878739394

In [6]:
df.head(8)

    ID employ_name        add  dept  age    PHONE NO
0  210       rahul     jaipur    cs   20  5657484938
1  211        ajay      sikar    it   21  3938475647
2  212       vijay      ajmer  mech   22  1937568494
3  213        ojas  ahmedabad    cs   20  2048593853
4  214       palak     jaipur    it   21  3453498679
5  215     pallavi       kota  mech   20  7647659323
6  216     deepali      hisar    it   22  7867676487
7  217       kriti      sikar    it   23  5657383947

In [8]:
df["add"][4]

'jaipur'

In [9]:
import pandas as pd
df=pd.DataFrame(emp_data,index=["A","B","C","D","E","F","G","H","I","J","K","L","M","N","O"])
df

    ID employ_name        add        dept  age    PHONE NO
A  210       rahul     jaipur          cs   20  5657484938
B  211        ajay      sikar          it   21  3938475647
C  212       vijay      ajmer        mech   22  1937568494
D  213        ojas  ahmedabad          cs   20  2048593853
E  214       palak     jaipur          it   21  3453498679
F  215     pallavi       kota        mech   20  7647659323
G  216     deepali      hisar          it   22  7867676487
H  217       kriti      sikar          it   23  5657383947
I  218    tanishka      sikar          cs   23  5757575843
J  219     anchita     jaipur          cs   24  8784857683
K  220       vijay       kota          it   21  3857693758
L  221       sajal  ahmedabad        mech   20  2857583848
M  222       simar   bhilwara  electrical   21  4545454545
N  223       megha      ajmer          cs   22  7686868683
O  224      aditya     jaipur          cs   20  7878739394

In [13]:
import pandas as pd
df=pd.DataFrame(emp_data,index=[name])
df["add"]["sajal"]

'ahmedabad'

In [15]:
import pandas as pd
df=pd.DataFrame(emp_data)
df

     ID employ_name        add        dept  age    PHONE NO
0   210       rahul     jaipur          cs   20  5657484938
1   211        ajay      sikar          it   21  3938475647
2   212       vijay      ajmer        mech   22  1937568494
3   213        ojas  ahmedabad          cs   20  2048593853
4   214       palak     jaipur          it   21  3453498679
5   215     pallavi       kota        mech   20  7647659323
6   216     deepali      hisar          it   22  7867676487
7   217       kriti      sikar          it   23  5657383947
8   218    tanishka      sikar          cs   23  5757575843
9   219     anchita     jaipur          cs   24  8784857683
10  220       vijay       kota          it   21  3857693758
11  221       sajal  ahmedabad        mech   20  2857583848
12  222       simar   bhilwara  electrical   21  4545454545
13  223       megha      ajmer          cs   22  7686868683
14  224      aditya     jaipur          cs   20  7878739394

In [16]:
df["dept"][8]

'cs'

In [17]:
df["dept"][8]="mech"
df

/var/folders/32/gzlv94vs0n9_8zhf76n9h16r0000gn/T/ipykernel_89905/2013624492.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["dept"][8]="mech"

     ID employ_name        add        dept  age    PHONE NO
0   210       rahul     jaipur          cs   20  5657484938
1   211        ajay      sikar          it   21  3938475647
2   212       vijay      ajmer        mech   22  1937568494
3   213        ojas  ahmedabad          cs   20  2048593853
4   214       palak     jaipur          it   21  3453498679
5   215     pallavi       kota        mech   20  7647659323
6   216     deepali      hisar          it   22  7867676487
7   217       kriti      sikar          it   23  5657383947
8   218    tanishka      sikar        mech   23  5757575843
9   219     anchita     jaipur          cs   24  8784857683
10  220       vijay       kota          it   21  3857693758
11  221       sajal  ahmedabad        mech   20  2857583848
12  222       simar   bhilwara  electrical   21  4545454545
13  223       megha      ajmer          cs   22  7686868683
14  224      aditya     jaipur          cs   20  7878739394